// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Tamil (`ta`).
class AppLocalizationsTa extends AppLocalizations {
  AppLocalizationsTa([String locale = 'ta']) : super(locale);

  @override
  String get hello => 'வணக்கம் உலகமே!';

  @override
  String get start => 'திட்டமிடலைத் தொடங்குங்கள்';

  @override
  String get book => 'பயணச்சீட்டுகளை முன்கூட்டியே முன்பதிவு செய்வதும், பட்ஜெட்டுக்கு ஏற்ற தங்குமிடங்களைத் தேர்ந்தெடுப்பதும் செலவுகளைக் குறைக்க உதவும்.';

  @override
  String get how => '2. பயணம் செய்யும்போது பணத்தை எப்படி சேமிப்பது?';

  @override
  String get theBest => 'சிறந்த நேரம் என்பது நீங்கள் செல்லவிருக்கும் இடத்தையும் உங்கள் தனிப்பட்ட விருப்பங்களையும் பொறுத்தது.';

  @override
  String get what => '1. பயணம் செய்வதற்கு சிறந்த நேரம் எது?';

  @override
  String get freq => 'அடிக்கடி கேட்கப்படும் கேள்விகள்';

  @override
  String get trav => 'நீங்கள் வாங்கும் பொருட்களில், பயணம் மட்டுமே உங்களை மேலும் செல்வந்தராக்கும்.';

  @override
  String get always => 'உங்கள் பயணத்தை எப்போதும் முன்கூட்டியே திட்டமிடுங்கள், முக்கியமான ஆவணங்களின் நகல்களை உங்களுடன் வைத்திருங்கள், மேலும் உள்ளூர் பழக்கவழக்கங்களை மதியுங்கள். போதுமான அளவு தண்ணீர் எடுத்துச் செல்லுங்கள், உங்கள் அன்புக்குரியவர்களுடன் தொடர்பில் இருங்கள், மேலும் உங்கள் பயணத்தின்போது பாதுகாப்பிற்கு முன்னுரிமை கொடுங்கள்.';

  @override
  String get travel => 'பயணக் குறிப்புகள்';

  @override
  String get shop => 'நினைவுப் பொருட்கள் வாங்குதல்';

  @override
  String get photo => 'புகைப்படம் எடுத்தல் மற்றும் சுற்றிப் பார்த்தல்';

  @override
  String get pop => 'பிரபலமான செயல்பாடுகள்';

  @override
  String get traveling => 'பயணம் செய்வது மக்களுக்கு ஓய்வெடுக்கவும், பல்வேறு பாரம்பரியங்களைப் பற்றி அறிந்துகொள்ளவும், மதிப்புமிக்க அனுபவங்களைப் பெறவும் உதவுகிறது. நீங்கள் மலைகள், கடற்கரைகள் அல்லது நகரங்களை விரும்பினாலும், ஒவ்வொரு இடமும் தனக்கென ஒரு தனித்துவமான அனுபவத்தை வழங்குகிறது.';

  @override
  String get why => 'ஏன் பயணிக்க வேண்டும்?';

  @override
  String get traAll => 'பயணம் செய்வது, புதிய கலாச்சாரங்களை ஆராயவும், அழகான நிலப்பரப்புகளை அனுபவிக்கவும், நண்பர்கள் மற்றும் குடும்பத்தினருடன் மறக்க முடியாத நினைவுகளை உருவாக்கவும் உங்களுக்கு வாய்ப்பளிக்கிறது.';

  @override
  String get dis => 'அற்புதமான இடங்களைக் கண்டறியுங்கள்';

  @override
  String get guide => 'பயண வழிகாட்டி';
}
